pali-lessons/pali-cheatsheet-small.tex
% Intended LaTeX compiler: pdflatex
\documentclass[11pt,oneside]{memoir}
\setstocksize{297mm}{100mm} \settrimmedsize{\stockheight}{\stockwidth}{*} \setlrmarginsandblock{5mm}{5mm}{*} \setulmarginsandblock{5mm}{5mm}{*} \setheaderspaces{*}{0pt}{*} \setlength{\footskip}{0pt} \checkandfixthelayout
\input{./vocabulary-preamble.tex}
\setcounter{secnumdepth}{2}
\date{\today}
\title{Pāli Cheatsheet (Small)}
\hypersetup{
 pdfauthor={The Bhikkhu Saṅgha},
 pdftitle={Pāli Cheatsheet (Small)},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\chapter{Tenses and Pronouns}
\label{sec:org56d9a42}

\begin{tabular}{lll}
\uline{Present} & \textbf{sg.} & \textbf{pl.}\\
\textbf{1st} & -mi & -ma\\
\textbf{2nd} & -si & -tha\\
\textbf{3rd} & -ti & -(a)nti\\
\hline
\uline{Future} & \textbf{sg.} & \textbf{pl.}\\
\textbf{1st} & -issāmi & -issāma\\
\textbf{2nd} & -issasi & -issatha\\
\textbf{3rd} & -issati & -issanti\\
\hline
\uline{Past} & \textbf{sg.} & \textbf{pl.}\\
\textbf{1st} & -iṁ & -(i)mhā, -(i)mha\\
\textbf{2nd} & -o, -i & -(i)ttha\\
\textbf{3rd} & -i & -(i)ṁsu, -uṁ\\
\hline
\uline{P.Nom.} & \textbf{sg.} & \textbf{pl.}\\
\textbf{1st} & ahaṁ & amhe, mayaṁ, no\\
\textbf{2nd} & tuvaṁ, tvaṁ & tumhe, vo\\
\textbf{3rd.masc.} & so, sa & te\\
\textbf{3rd.nt.} & taṁ, tad & tāni\\
\textbf{3rd.fem.} & sā & tā, tāyo\\
\hline
\uline{P.Gen.} & \textbf{sg.} & \textbf{pl.}\\
\textbf{1st} & mama, me & amhākaṁ, no\\
 & mayhaṁ & amhākaṁ, no\\
\textbf{2nd} & tava, te & tumhākam\\
 & tuyhaṁ & \\
\textbf{3rd.masc.} & tassa & tesaṁ\\
\textbf{3rd.nt.} & tassa & tesaṁ\\
\textbf{3rd.fem.} & tassā & tāsaṁ\\
\end{tabular}

\begin{tabular}{ll}
ta → & \emph{(nom.sg.)} so / taṁ / sā\\
 & \emph{(nom.pl.)} te / tāni / tā, tāyo\\
 & \emph{(acc.sg.)} taṁ\\
 & \emph{(acc.pl.)}  te / tāni / tā, tāyo\\
\end{tabular}

\textbf{\uline{Interrogatives:}}

\begin{tabular}{lll}
ko & {[}ka + o] & who? what? which?\\
kiṁ & {[}ka + iṁ] & who? what? which? why?\\
katama & {[}ka + tama] & what? which (of many)?\\
kuhiṁ & {[}ka + hiṁ] & where is? where to?\\
kattha & {[}ka + ttha] & where at?\\
kuto & {[}ka + to] & where from?\\
kacci & {[}ka + ci] & I hope\ldots{}?\\
kati & {[}ka + ti] & how many?\\
kinti & {[}kiṁ + iti] & how then? in what way?\\
\end{tabular}
\end{document}
